tests/load_tests/extremely_low_load.yaml
config:
  target: '{{ $processEnvironment.API_URL }}'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 2
      name: 'Ramping up to target load'
    - duration: 120
      arrivalRate: 2
      name: 'Sustaining 2 requests per second for two minutes'

  plugins:
    ensure:
      thresholds:
        - http.codes.200: 95 # Fail if less than 95% of responses are OK
        - http.response_time.p99: 30000 # Fail if 99% of requests take > 30s

scenarios:
  - name: 'Request ticket and poll for completion'
    flow:
      - put:
          url: '/ticket'
          capture:
            json: '$.bookingReferenceId'
            as: 'refId'

      # Wait 5 seconds
      - think: 5

      - loop:
          - get:
              url: '/ticket/{{ refId }}'
              capture:
                json: '$.status'
                as: 'currentStatus'
          - think: 5
        whileTrue: "currentStatus == 'PENDING' || currentStatus == 'RUNNING'"
        count: 24 # Max 2 minutes