tests/load_tests/load_test.yaml
config:
  target: '{{ $processEnvironment.WSS_URL }}'
  processor: './processor.js'
  statsInterval: 10

  plugins:
    metrics-by-endpoint: {}
    ensure:
      thresholds:
        - workflow_duration_ms.p99: 30000
      maxErrorRate: 5 # Fails if the error rate exceeds 5%

  # Run via: artillery run -e [name] load_test.yaml
  environments:
    medium_load:
      phases:
        - duration: 60
          arrivalRate: 1
          rampTo: 80
          name: 'Ramping up to target load'
        - duration: 120
          arrivalRate: 80
          name: 'Sustaining 80 requests per second for two minutes'

    full_load:
      phases:
        - duration: 60
          arrivalRate: 1
          rampTo: 160
          name: 'Ramping up to target load'
        - duration: 120
          arrivalRate: 160
          name: 'Sustaining 160 requests per second for two minutes'

scenarios:
  - name: 'Book ticket and await completion'
    flow:
      - function: 'runWebSocketWorkflow'