tests/load_tests/low_load.yaml
config:
  target: '{{ $processEnvironment.API_URL }}'
  processor: './processor.js'
  statsInterval: 10
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: 'Ramping up to target load'
    - duration: 120
      arrivalRate: 5
      name: 'Sustaining 5 requests per second for two minutes'
  defaults:
    headers:
      Content-Type: 'application/json'
  plugins:
    # Capture metrics
    metrics-by-endpoint: {}
    ensure:
      thresholds:
        - http.codes.200: 95 # Fail if less than 95% of responses are OK
        - http.response_time.p99: 30000 # Fail if 99% of requests take > 30s

scenarios:
  - name: 'Request ticket and poll for completion'
    flow:
      - put:
          url: '/ticket'
          capture:
            json: '$.bookingReferenceId'
            as: 'bookingRef'
          expect:
            - statusCode: 202

      # Poll for results using JS function
      # Pass bookingRef and wait for status to change from PENDING/RUNNING
      - function: 'pollBookingStatus'