tests/load_tests/low_medium_load.yaml
config:
  target: 'https://dz8kkiyfhg.execute-api.eu-north-1.amazonaws.com/ticket'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 30
      name: 'Ramping up to target load'
    - duration: 120
      arrivalRate: 30
      name: 'Sustaining 40 requests per second for two minutes'

  plugins:
    ensure:
      thresholds:
        - http.codes.200: 95 # Fail if less than 95% of responses are OK
        - http.response_time.p99: 10000 # Fail if 99% of requests take > 10s

scenarios:
  - name: 'Request Tickets'
    flow:
      - put:
          url: '/ticket'